In [5]:
import pandas as pd

df = pd.read_csv(r"C:\Users\user\Downloads\판다스입문_codes\data\weather.csv")

In [7]:
import pandas as pd

df = pd.DataFrame({"a": [10, 20, 30], 
                   "b": [20, 30, 40]})
print(df)

    a   b
0  10  20
1  20  30
2  30  40

In [11]:
dir(df)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       3 non-null      int64
 1   b       3 non-null      int64
dtypes: int64(2)
memory usage: 180.0 bytes

In [15]:
df['a'] ** 2

0    100
1    400
2    900
Name: a, dtype: int64

In [19]:
# 사용자가 정의한 함수를 데이터프레임에 적용해보기

# 함수 정의
def my_sq(x) : return x**2

In [23]:
# 시리트에 적용해보기
df['a'].apply(my_sq)
df.iloc[0].apply(my_sq)

a    100
b    400
Name: 0, dtype: int64

In [29]:
# 함수 정의
def my_sq2(x,y) : return x**y

#df['a'].apply(my_sq2) #오류가 발생, 입력값이 두개이기 때문에
df['a'].apply(my_sq2,y=3) #y값을 따로 입력해줌

0     1000
1     8000
2    27000
Name: a, dtype: int64

In [41]:
# 입력값이 3개인 함수 정의
def my_sq3(X, y, z): return (X + y + z)/3

# apply 사용 예시
df.apply(my_sq3, args=(10, 20), axis=1)

           a          b
0  13.333333  16.666667
1  16.666667  20.000000
2  20.000000  23.333333

In [43]:
# 직원 명단 DataFrame 생성
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [25, 45, 35, 32, 28],
    'Salary': [5000, 7000, 6500, 5500, 6000]
}

df = pd.DataFrame(data)
df

      Name  Age  Salary
0    Alice   25    5000
1      Bob   45    7000
2  Charlie   35    6500
3    David   32    5500
4      Eva   28    6000

In [51]:
# 함수 생성
def categorize_by_age(age):
    if age < 30: return 'Young'
    elif 30 <= age < 40: return 'Mid'
    else: return 'Experienced'

# 'Category' 컬럼을 추가하여 나이에 따른 분류 적용
df['Category'] = df['Age'].apply(categorize_by_age)

# 월급에 보너스 10%를 추가한 컬럼을 제작, 람다 함수 사용
df['Bonus'] = df['Salary'].apply(lambda x: x * 1.1)

df

      Name  Age  Salary     Category   Bonus
0    Alice   25    5000        Young  5500.0
1      Bob   45    7000  Experienced  7700.0
2  Charlie   35    6500          Mid  7150.0
3    David   32    5500          Mid  6050.0
4      Eva   28    6000        Young  6600.0

In [53]:
df1 = pd.read_csv(r"C:\Users\user\Downloads\판다스입문_codes\data\concat_1.csv")
df2 = pd.read_csv(r"C:\Users\user\Downloads\판다스입문_codes\data\concat_2.csv")
df3 = pd.read_csv(r"C:\Users\user\Downloads\판다스입문_codes\data\concat_3.csv")

In [65]:
df_total = pd.concat([df1, df2, df3])
df_total.reset_index()

    index    A    B    C    D
0       0   a0   b0   c0   d0
1       1   a1   b1   c1   d1
2       2   a2   b2   c2   d2
3       3   a3   b3   c3   d3
4       0   a4   b4   c4   d4
5       1   a5   b5   c5   d5
6       2   a6   b6   c6   d6
7       3   a7   b7   c7   d7
8       0   a8   b8   c8   d8
9       1   a9   b9   c9   d9
10      2  a10  b10  c10  d10
11      3  a11  b11  c11  d11

In [69]:
from pathlib import Path
import pandas as pd

# 파일 경로 설정을 통해 리스크형태로 파일들을 불러옴
billboard_data_files = sorted(
    list(Path(r"C:\Users\user\Downloads\판다스입문_codes\data\billboard-by_week").glob("billboard-*.csv"))
)

# 모든 CSV 파일을 읽어서 DataFrame 리스트로 저장
data_frames = [pd.read_csv(file) for file in billboard_data_files]

# DataFrame들을 하나로 합쳐 인덱스까지 재설정
df_combined = pd.concat(data_frames, ignore_index=True)

# 결과 확인
print(df_combined)

       year            artist                    track  time date.entered  \
0      2000             2 Pac  Baby Don't Cry (Keep...  4:22   2000-02-26
1      2000           2Ge+her  The Hardest Part Of ...  3:15   2000-09-02
2      2000      3 Doors Down               Kryptonite  3:53   2000-04-08
3      2000      3 Doors Down                    Loser  4:24   2000-10-21
4      2000          504 Boyz            Wobble Wobble  3:35   2000-04-15
...     ...               ...                      ...   ...          ...
24087  2000       Yankee Grey     Another Nine Minutes  3:10   2000-04-29
24088  2000  Yearwood, Trisha          Real Live Woman  3:55   2000-04-01
24089  2000   Ying Yang Twins  Whistle While You Tw...  4:19   2000-03-18
24090  2000     Zombie Nation            Kernkraft 400  3:30   2000-09-02
24091  2000   matchbox twenty                     Bent  4:12   2000-04-29

       week  rating
0       wk1    87.0
1       wk1    91.0
2       wk1    81.0
3       wk1    76.0
4       wk1    57.0
...     ...     ...
24087  wk76     NaN
24088  wk76     NaN
24089  wk76     NaN
24090  wk76     NaN
24091  wk76     NaN

[24092 rows x 7 columns]

In [71]:
!python --version

Python 3.12.4